# задача 482
#
# Дано послідовність цілих чисел, які записані в одному рядку через пропуск.
# Утворіть і надрукуйте голову (перший елемент) і хвіст (усі інші елементи) вказаної послідовності не використовуючи цикли і зрізи.
# Довжина послідовності може бути довільною.
#
# Вхідні дані:
#
# 2 10 15 9 3 6 7 11
#
# Вихідні дані:
#
# 2
# 10 15 9 3 6 7 11

numbers = map(int, input(f"Enter numbers: ").split())
first_num = next(numbers)
print(first_num)
print(*numbers)

