# задача 483
# Напишіть програму, яка виводить частину послідовності 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5...
# (число повторюється стільки разів, чому дорівнює). На вхід програми передається невід’ємне
# ціле число n - стільки елементів послідовності повинна надрукувати програма. На виході очікується
# послідовність чисел, записаних через пропуск в один рядок.
#
# Вхідні дані:
#
# 8
#
# Вихідні дані:
#
# 1 2 2 3 3 3 4 4
num = int(input("Enter number: "))
result = []
current_num = 1
while len(result) < num:
    for it in range(current_num):
        if len(result) < num:
            result.append(current_num)
        else:
            break
    current_num += 1
print(*result)