# завдання 488
#
# Вводиться рядок, що складається із слів, розділених пропусками.
# Потрібно впорядкувати слова в рядку так, щоб найбільш короткі з них були спочатку рядка, а найбільш довгі в кінці.
# Слова необхідно вивести на екран через кому і пропуск, а рядок впорядкованих слів має закінчуватися крапкою.
#
# Вхідні дані:
#
# ab aaab ba baaaaa a aba
#
# Вихідні дані:
#
# a, ab, ba, aba, aaab, baaaaa.

words = input(f"Enter words: ").split()
sorted_words = sorted(words, key=len)
result = ", ".join(sorted_words)
print(result,".")
