# задача 471
#
#
# Розташувати додатні і від’ємні числа введеної послідовності цілих чисел на початку списку і
# у кінці списку відповідно (за спаданням). Числа, рівні нулю, ігнорувати. Вивести на екран результуючий список.
#
# Вхідні дані:
#
# 1 3 -5 0 10 -2 12 45 7 0 9 -4 -11 15 22 3
#
# Вихідні дані:
#
# 45 22 15 12 10 9 7 3 3 1 -2 -4 -5 -11

numbers = list(map(int, input(f"Enter numbers: ").split()))
numbers = sorted(numbers)
numbers = reversed(numbers)
for it in numbers:
    if it != 0:
        print(it, end=" ")








