# задача 421
# Вводиться список цілих чисел в одному рядку через пропуск. Надрукуйте кількість елементів,
# які є за значенням більші за обох їх сусідів. Перший і останній елементи списку не слід
# розглядати, оскільки вони не мають двох сусідів.
#
# Вхідні дані:
#
# 1 2 1
# 1 3 2 4 2
# 1 2 3
#
# Вихідні дані:
#
# 1
# 2
# 0

numbers = list(map(int, input("Enter numbers: ").split()))
count = 0
for it in range(1, len(numbers) - 1):
    if numbers[it] > numbers[it - 1] and numbers[it] > numbers[it + 1]:
        count += 1
print(count)