# задача 483
#
# Напишіть програму, яка виводить частину послідовності 1 2 2 3 3 3 4 4 4 4 5 5 5 5 5...
# (число повторюється стільки разів, чому дорівнює).
# На вхід програми передається невід’ємне ціле число n - стільки елементів послідовності повинна надрукувати програма.
# На виході очікується послідовність чисел, записаних через пропуск в один рядок.
#
# Вхідні дані:
#
# 8
#
# Вихідні дані:
#
# 1 2 2 3 3 3 4 4

n = int(input(f"Enter number: "))
count = 0
current_number = 1
while count < n:
    for i in range(current_number):
        if count < n:
            print(current_number, end=" ")
            count = count + 1
        else:
            break
    current_number = current_number + 1
