# задача 459
# Програма отримує на вхід спадаючу послідовність натуральних чисел,
# що позначають значення зросту учнів. Після цього вводиться число - зріст учня,
# який має зайняти місце серед усіх інших. Всі числа у вхідних даних натуральні
# і не перевищують 200. Виведіть номер місця, яке має зайняти новий учень. Якщо є учні
# з однаковим зростом, таким же, як і у нового учня, то він повинен встати після них.
#
# Вхідні дані:
#
# 165 163 160 160 157 157 155 154
# 160
#
# Вихідні дані:
#
# 5

line = list(map(int, input("Enter the age of the students: ").split()))
new_student = int(input("Enter the age of the new student: "))
position = 1
for height in line:
    if height >= new_student:
        position = position + 1
    else:
        break
print(position)