# задача 478
# Напишіть програму, яка обчислює суму набанківському рахунку на основі журналу транзакцій.
# Формат журналу транзакцій відображається наступним чином де D – покласти на депозит ціле
# значення суми, а W - вилучити. Введення транзакцій завершується порожнім рядком
#
# Вхідні
# дані:
#
# D
# 100
# W
# 200
# D
# 300
# D
# 350
# W
# 200
# D
# 150
#
# Вихідні
# дані:
#
# 500

balance = 0
while True:
    line = input("Enter an action: ")
    if not line:
        break
    parts = line.split()
    if parts[0] == "D":
        balance += int(parts[1])
    elif parts[0] == "W":
        balance -= int(parts[1])
print(balance)