# задача 466
# Дано список цілих чисел, число k і значення c. Необхідно вставити у список
# на позицію з індексом k елемент, рівний c, зсунувши всі елементи вправо. Вставку
# необхідно здійснювати у самому списку, не роблячи цього при виведенні і не створюючи
# додаткового списку. Вводиться список чисел. Всі числа списку знаходяться на одному рядку.
# У наступному рядку вводяться два цілих числа.
#
# Вхідні дані:
#
# 9 4 6 2 0 7 14
# 3 0
#
# Вихідні дані:
#
# 9 4 6 0 2 0 7 14

numbers = list(map(int, input("Enter numbers: ").split()))
index, number = map(int, input("Enter index and number: ").split())
numbers.insert(index, number)
for it in numbers:
    print(it, end=" ")








