# задача 463
# У якийсь момент вам набридло використовувати імена файлів з пропусками і
# ви вирішили написати програму, яка перейменовує всі файли, що містять пропуски
# в імена, у яких групи прогалин замінено на символ підкреслення _. Програма отримує
# один рядок, що містить довільні символи, в тому числі і пропуски, і виводить правильну
# назву із символом підкреслення замість пропусків.
#
# Вхідні дані:
#
# my file.txt
# string     with        multi spaces
# single
#
# Вихідні дані:
#
# my_file.txt
# string_with_multi_spaces
# single

for repeat in range(3):
    file_name = input("Enter file name: ").split()
    new_file_name = "_".join(file_name)
    print(new_file_name)

