# задача 449
# Для списку цілих чисел знайдіть і надрукуйте елементи, які з’являються у списку лише
# один раз. Елементи повинні бути роздруковані у тому порядку, в якому вони перебувають у вхідному списку.
#
# Вхідні дані:
#
# 5 3 1 6 5 8 0 12
# 1 45 23 45 90 1 0
#
# Вихідні дані:
#
# 3 1 6 8 0 12
# 23 90 0
for repeat in range(2):
    numbers = list(map(int, input("Enter numbers: ").split()))
    for item in numbers:
        if numbers.count(item) == 1:
            print(item, end=" ")
    print()