# задача 474
# Вводиться непарне натуральне число n. Напишіть програму, яка створює зображення сніжинки
# за допомогою двовимірного масиву розміром n x n. Заповніть кожен елемент символом ..
# Потім заповніть середній рядок, середній стовпець і діагоналі символом *. Розділяйте символи одним пропуском.
#
# Вхідні дані:
#
# 7
#
# Вихідні дані:
#
# * . . * . . *
# . * . * . * .
# . . * * * . .
# * * * * * * *
# . . * * * . .
# . * . * . * .
# * . . * . . *

num = int(input("Enter number: "))
grid = []
for index in range(n):
    row = ["."] * num
    grid.append(row)
mid = num // 2
for index in range(num):
    grid[index][mid] = "*"
    grid[mid][index] = "*"
    grid[index][index] = "*"
    grid[index][num - 1 - index] = "*"
for row in grid:
    print(" ".join(row))