# задача 468
# Напишіть програму для видалення кожного третього елемента із цілочисельного списку
# і друку результуючого списку, доки список не стане порожнім. Початковий список
# цілих чисел вводиться в одному рядку через пропуск.
#
# Вхідні дані:
#
# 2 5 8 9 4 78 7 1
#
# Вихідні дані:
#
# [2, 5, 9, 4, 78, 7, 1]
# [2, 5, 4, 78, 7, 1]
# [2, 5, 78, 7, 1]
# [2, 5, 7, 1]
# [2, 5, 1]
# [2, 5]
# [5]
# []

numbers = list(map(int, input("Enter numbers: ").split()))
index = 0
while len(numbers) > 0:
    index = (index + 2) % len(numbers)
    numbers.pop(index)
    print(numbers)